yangfengwu45/learnHC32F460/例程(自己写的)/HC32F460Template/mcu/EWARM/HDSC_HC32F46x.svd
                <register>
                    <name>POSRE</name>
                    <description>desc POSRE</description>
                    <addressOffset>0x48</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POS00</name>
                            <description>desc POS00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS01</name>
                            <description>desc POS01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS02</name>
                            <description>desc POS02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS03</name>
                            <description>desc POS03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS04</name>
                            <description>desc POS04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS05</name>
                            <description>desc POS05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS06</name>
                            <description>desc POS06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS07</name>
                            <description>desc POS07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS08</name>
                            <description>desc POS08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS09</name>
                            <description>desc POS09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS10</name>
                            <description>desc POS10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS11</name>
                            <description>desc POS11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS12</name>
                            <description>desc POS12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS13</name>
                            <description>desc POS13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS14</name>
                            <description>desc POS14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS15</name>
                            <description>desc POS15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORRE</name>
                    <description>desc PORRE</description>
                    <addressOffset>0x4A</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POR00</name>
                            <description>desc POR00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR01</name>
                            <description>desc POR01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR02</name>
                            <description>desc POR02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR03</name>
                            <description>desc POR03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR04</name>
                            <description>desc POR04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR05</name>
                            <description>desc POR05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR06</name>
                            <description>desc POR06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR07</name>
                            <description>desc POR07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR08</name>
                            <description>desc POR08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR09</name>
                            <description>desc POR09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR10</name>
                            <description>desc POR10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR11</name>
                            <description>desc POR11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR12</name>
                            <description>desc POR12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR13</name>
                            <description>desc POR13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR14</name>
                            <description>desc POR14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR15</name>
                            <description>desc POR15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POTRE</name>
                    <description>desc POTRE</description>
                    <addressOffset>0x4C</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0xFFFF</resetMask>
                    <fields>
                        <field>
                            <name>POT00</name>
                            <description>desc POT00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT01</name>
                            <description>desc POT01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT02</name>
                            <description>desc POT02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT03</name>
                            <description>desc POT03</description>
                            <msb>3</msb>
                            <lsb>3</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT04</name>
                            <description>desc POT04</description>
                            <msb>4</msb>
                            <lsb>4</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT05</name>
                            <description>desc POT05</description>
                            <msb>5</msb>
                            <lsb>5</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT06</name>
                            <description>desc POT06</description>
                            <msb>6</msb>
                            <lsb>6</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT07</name>
                            <description>desc POT07</description>
                            <msb>7</msb>
                            <lsb>7</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT08</name>
                            <description>desc POT08</description>
                            <msb>8</msb>
                            <lsb>8</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT09</name>
                            <description>desc POT09</description>
                            <msb>9</msb>
                            <lsb>9</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT10</name>
                            <description>desc POT10</description>
                            <msb>10</msb>
                            <lsb>10</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT11</name>
                            <description>desc POT11</description>
                            <msb>11</msb>
                            <lsb>11</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT12</name>
                            <description>desc POT12</description>
                            <msb>12</msb>
                            <lsb>12</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT13</name>
                            <description>desc POT13</description>
                            <msb>13</msb>
                            <lsb>13</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT14</name>
                            <description>desc POT14</description>
                            <msb>14</msb>
                            <lsb>14</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POT15</name>
                            <description>desc POT15</description>
                            <msb>15</msb>
                            <lsb>15</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PIDRH</name>
                    <description>desc PIDRH</description>
                    <addressOffset>0x50</addressOffset>
                    <size>16</size>
                    <access>read-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>PIN00</name>
                            <description>desc PIN00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN01</name>
                            <description>desc PIN01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-only</access>
                        </field>
                        <field>
                            <name>PIN02</name>
                            <description>desc PIN02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PODRH</name>
                    <description>desc PODRH</description>
                    <addressOffset>0x54</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POUT00</name>
                            <description>desc POUT00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT01</name>
                            <description>desc POUT01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUT02</name>
                            <description>desc POUT02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POERH</name>
                    <description>desc POERH</description>
                    <addressOffset>0x56</addressOffset>
                    <size>16</size>
                    <access>read-write</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POUTE00</name>
                            <description>desc POUTE00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE01</name>
                            <description>desc POUTE01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>read-write</access>
                        </field>
                        <field>
                            <name>POUTE02</name>
                            <description>desc POUTE02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>read-write</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>POSRH</name>
                    <description>desc POSRH</description>
                    <addressOffset>0x58</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POS00</name>
                            <description>desc POS00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS01</name>
                            <description>desc POS01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POS02</name>
                            <description>desc POS02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
                <register>
                    <name>PORRH</name>
                    <description>desc PORRH</description>
                    <addressOffset>0x5A</addressOffset>
                    <size>16</size>
                    <access>write-only</access>
                    <resetValue>0x0</resetValue>
                    <resetMask>0x7</resetMask>
                    <fields>
                        <field>
                            <name>POR00</name>
                            <description>desc POR00</description>
                            <msb>0</msb>
                            <lsb>0</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR01</name>
                            <description>desc POR01</description>
                            <msb>1</msb>
                            <lsb>1</lsb>
                            <access>write-only</access>
                        </field>
                        <field>
                            <name>POR02</name>
                            <description>desc POR02</description>
                            <msb>2</msb>
                            <lsb>2</lsb>
                            <access>write-only</access>
                        </field>
                    </fields>
                </register>
